// Напишите программу, которая на 
// вход принимает число (N), а на выходе 
// показывает все чётные числа от 1 до N.

Console.WriteLine("Введите число: ");

int a = int.Parse(Console.ReadLine());

int min = 1;
int max = a;
int r = a % 2;

while (min = 1; min <= max; min++);
{
  if (r = 0) ;
  {
    Console.WriteLine(min);
  }
}



